[
    {
        "id": 1,
        "title": "Apa Itu Programmer? Hal-Hal Yang Wajib Dikuasai",
        "slug_title": "apa-itu-programmer-hal-hal-yang-wajib-dikuasai",
        "category_id": 2,
        "img_thumbnail": "apa-itu-programmer-hal-hal-yang-wajib-dikuasai-16716785691.png",
        "description": "<p>Halo teman-teman!<p>Perkembangan teknologi dapat membuka lapak kerja bagi seseorang. Terutama di era digital zaman<em>&nbsp;now</em>&nbsp;saat ini. Banyak&nbsp;<em>startup</em>&nbsp;yang membutuhkan pekerjaan untuk membuat dan mengembangkan suatu teknologi. Satu di antaranya adalah profesi&nbsp;programmer<em>.</em>&nbsp;</p><p>Programmer merupakan<em>&nbsp;</em>profesi yang diminati oleh kalangan muda saat ini. Di samping itu, profesi ini dianggap mempunyai prospek masa depan. Kata &ldquo;keren&rdquo; dan &ldquo;gaji besar&rdquo; sering dilontarkan kepada&nbsp;programmer. Hal tersebut tentu sangat menarik perhatian, khususnya bagi kamu yang ingin mencicipi manisnya menjadi seorang&nbsp;programmer&nbsp;yang handal.</p><p>Lalu, apa itu&nbsp;programmer? Hal-hal apa saja yang wajib dikuasai oleh&nbsp;programmer? Ok, kita akan membahas mengenai&nbsp;programme<em><em>r</em>,&nbsp;</em>Yuk simak bersama-sama.</p><h2>Mengenal Apa Itu Programmer?</h2><p><img alt=\"back end developer\" src=\"https://www.dicoding.com/blog/wp-content/uploads/2020/04/internship-rendi-photo-backend.png\"></p><p>Mari kita berkenalan dengan profesi yang satu ini. Sebelumnya kamu pernah dengar apa dan seperti apa programmer itu? Jika belum, perhatikan pengertian di bawah ini ya.</p><p>Programmer adalah sebuah jenis profesi atau pekerjaan yang bertujuan untuk membuat sebuah sistem menggunakan bahasa pemrograman. Seseorang yang memiliki&nbsp;<em>skill</em>&nbsp;menulis kode program (<em>syntax</em>) dan merancang sistem, bisa juga disebut&nbsp;<em>programmer</em><em>.&nbsp;</em>Kode atau bahasa program yang dimaksud seperti Java, Python, Javascript, PHP, dll.</p><p>Sistem yang sering kamu gunakan sehari-hari, seperti web, aplikasi Android, sistem operasi (Windows, Linux, iOS) dll, itu semua dibuat dengan bahasa pemrograman yang disusun oleh para&nbsp;programmer.<em>&nbsp;</em></p><h2>Tugas Seorang Programmer</h2><p><img alt=\"work \" src=\"https://www.dicoding.com/blog/wp-content/uploads/2020/04/internship-rendi-photo-example-efisien.png\"></p><p>Dari pengertian diatas kamu sudah dapat menyimpulkan. Bahwa programmer bertugas untuk membuat sistem aplikasi atau bahkan mengembangkan aplikasi. Tugas&nbsp;programmer&nbsp;meliputi:</p><ul>\r\n\t<li>Menganalisis kebutuhan.</li>\r\n\t<li>Merancang dan memodelkan sistem seperti UML,&nbsp;<em>flowchart, ERD&nbsp;</em>dll.</li>\r\n\t<li>Menulis kode program (HTML, CSS, Javascript dll).</li>\r\n\t<li>Men-<em>debugging</em>&nbsp;program.</li>\r\n\t<li>Menguji atau&nbsp;<em>testing</em>&nbsp;program.</li>\r\n</ul><h2>Jenis-jenis Programmer yang Umum</h2><p><img alt=\"type programmer\" src=\"https://www.dicoding.com/blog/wp-content/uploads/2020/05/internship-rendi-type-programmer.png\"></p><p>Apakah kamu sudah tahu jenis-jenis&nbsp;<em>programmer</em>? Meskipun&nbsp;programmer&nbsp;identik dengan program perkomputeran, namun pada kenyataannya profesi ini banyak jenisnya&nbsp;<em>lho</em>. Jika kamu ingin menjadi&nbsp;programmer<em>,&nbsp;</em>fokuslah pada jalur&nbsp;programmer<em>&nbsp;</em>yang kamu minati. Agar apa? Agar kamu tahu arah pekerjaannya, serta hasil yang didapat.</p><p>Berikut ini merupakan berbagai jalur programmer yang bisa Anda pilih:</p><h3>1.&nbsp;Programmer Web</h3><p>Jenis yang satu ini sudah umum kamu dengar.&nbsp;Programmer&nbsp;web sangat diminati oleh perusahaan atau&nbsp;<em>startup</em>. Sebab, hampir semua perusahaan mempunyai web. Tidak sembarang orang dapat mengelola sebuah web karena dibutuhkan tenaga ahli seperti&nbsp;programmer<em>&nbsp;</em>agar menjamin mutu kualitas web tersebut.</p><p>Tugas utama&nbsp;web programmer adalah berfokus mengembangkan situs internet dan website, seperti pembuatan website toko online, sosmed, layanan service, dsb. Seorang web programmer juga dapat mengoperasikan&nbsp;<em>database&nbsp;</em>pada&nbsp;sebuah website.&nbsp;</p><h3>2. Programmer Aplikasi</h3><p>Programmer aplikasi adalah&nbsp;programmer&nbsp;pembuat aplikasi pada komputer maupun smartphone. Contohnya aplikasi yang terinstal di desktop mu, seperti antivirus, browser, tools-tools, dll. Ada juga di&nbsp;<em>smartphone</em>&nbsp;milikmu, seperti aplikasi (Android/ iOS), game, sosmed yang biasa kamu unduh di&nbsp;<em>Playstore</em>&nbsp;maupun&nbsp;<em>Appstore</em>.</p><p>Prospek jenis programmer yang satu ini cukup menjanjikan. Pasalnya, hampir semua orang mempunyai&nbsp;<em>smartphone</em>. Inilah alasan utama kenapa orang berlomba-lomba ingin menjadi&nbsp;programmer&nbsp;Android atau sebagainya.</p><h3>3. Programmer Embedded System</h3><p>Pekerjaan programmer&nbsp;<em>embedded system</em>&nbsp;adalah menulis&nbsp;<em>source code</em>&nbsp;sistem untuk mengontrol peralatan rumah/elektronik. Sistem tertanam digunakan dalam berbagai macam benda yang berada di dekat Anda seperti ponsel, kamera digital,&nbsp;<em>remote control</em>, mesin cuci, dll.</p><p>Baca juga artikel&nbsp;&nbsp;<strong><a href=\"https://www.dicoding.com/blog/?p=11611\">Apa itu Full Stack Developer? Keahlian-keahlian yang harus dikuasai</a></strong></p><h2>Hal-Hal yang Wajib Dikuasai oleh Seorang Programmer</h2><p><img alt=\"wireframe\" src=\"https://www.dicoding.com/blog/wp-content/uploads/2020/06/internship-activity.png\"></p><p>Hal-hal apa saja yang wajib dikuasai oleh seorang&nbsp;programmer? Nah, ini lah beberapa hal atau keterampilan seorang programmer diantaranya sebagai berikut ini:</p><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai Algoritma</strong></h3>\r\n\r\n\t<p>Dalam membuat sebuah aplikasi,&nbsp;programmer&nbsp;harus memikirkan metode yang sesuai untuk pemrosesan sistem. Kenapa algoritma begitu penting&nbsp;<em>sih</em>? Sebab, dengan algoritma kamu dapat memecahkan suatu masalah. Kamu mesti tau fungsi, perulangan, bahkan tipe data seperti&nbsp;<em>array</em>&nbsp;dan lainnya. Oleh karena itu, algoritma adalah kunci utama seorang&nbsp;programmer<em>.</em></p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Mempunyai Keterampilan Membaca Kode</strong></h3>\r\n\r\n\t<p>Kamu harus pandai membaca dan memahami proyek-proyek&nbsp;<em>open source</em>&nbsp;yang ada di&nbsp;<strong>Sourceforge</strong>&nbsp;atau&nbsp;<a href=\"https://www.dicoding.com/blog/perbedaan-git-dan-github/\"><strong>GitHub</strong></a>. Terkadang programmer lupa akan hal yang satu ini. Padahal ini penting&nbsp;<em>lho</em>. Coba pahami cara kerjanya serta temukan polanya. Di situlah terdapat sesuatu ide yang bisa kamu terapkan dalam proyek.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai Satu Atau Lebih Bahasa Pemrograman.</strong></h3>\r\n\r\n\t<p>Programmer wajib menguasai bahasa pemrograman. Ada 2 pilihan bagi programmer, yaitu menguasai satu bahasa atau lebih. Jika kamu menguasai satu&nbsp;<a href=\"https://www.dicoding.com/blog/5-bahasa-pemrograman-terbaik/\">bahasa pemrograman</a>&nbsp;jadilah spesialisnya. Namun&nbsp;<em>zaman now</em>&nbsp;dapat dikatakan bahwa teknologi semakin berkembang, akan lebih baik kamu menguasai multi-bahasa. Tentunya kamu harus jadi spesialis di antara satunya ya. Analoginya seperti dokter umum dan dokter spesialis, pasti tahu kan bedanya?</p>\r\n\r\n\t<p>Memang mempelajari banyak bahasa akan membuatmu dapat bekerja pada banyak bahasa. Serta membuat kamu paham perbedaan dari setiap bahasa pemrograman. Tapi kamu harus punya spesialis 1 bahasa terlebih dahulu sebelum mencoba yang lain.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai OOP (Object Oriented Programming)&nbsp;</strong></h3>\r\n\r\n\t<p>Kenapa kamu&nbsp; harus belajar OOP? Dengan menguasai OOP, akan membuat kode program menjadi lebih terstruktur dan mudah dibaca. Bayangkan jika menulisnya dengan satu&nbsp;<em>script</em>&nbsp;besar atau prosedural. Wah, pasti akan repot ya.</p>\r\n\r\n\t<p>Jika kamu ingin menguasai web<em>&nbsp;framework</em>, maka kamu dapat&nbsp;menulis suatu library sendiri. Dan itu perlu menguasai dulu OOP dan&nbsp;<em>Design Pattern.</em>&nbsp;</p>\r\n\r\n\t<p>Walaupun OOP itu penting, pada kenyataanya tidak harus diterapkan di semua bahasa pemrograman. Terkadang ada beberapa bahasa pemrograman fungsional tidak memerlukan konsep OOP.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai Jaringan Komputer</strong></h3>\r\n\r\n\t<p>Kamu wajib menguasai setidaknya dasar-dasar jaringan komputer. Seperti apa tuh? Seperti konfigurasi<em>&nbsp;ip address</em>,&nbsp;<em>subnetting</em>, dan&nbsp;<em>client server</em>. Mungkin bagi kamu agak sedikit malas untuk mempelajari TCP/IP dan OSI. Namun, agar lebih cakep lagi jika kamu mampu menguasainya. Hal tersebut penting sebelum kamu masuk ke dunia internet dan<em>&nbsp;cloud computing</em>.</p>\r\n\r\n\t<p>Memang tidak semua aplikasi yang dibangun harus terhubung ke internet. Namun kamu harus berperan ganda sebagai&nbsp;<em>network engineering</em>. Kenapa? Karena kamu mesti tahu seluk beluk cara menghubungkan aplikasi ke jaringan, baik itu lokal maupun internet.</p>\r\n\r\n\t<p>Berbagai protokol internet mesti kamu ketahui yakni HTTP, HTTPS, TELNET, FTP, SMTP, SOAP,<em>&nbsp;Oauth</em>,&nbsp;<em>Websocket,</em>&nbsp;dll.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Desain Layout Aplikasi dan Database</strong></h3>\r\n\r\n\t<p>Apa perlu jago desain juga? Sebenarnya pekerjaan ini bisa dikerjakan oleh desainer atau&nbsp;<em>front end</em>. Sebagai programmer yang handal, kamu harus menguasai keduanya. Yaitu antara desain dan logika. Tidak hanya tentang coding saja ya. Ada kalanya kamu terjun ke dunia desain karena layout aplikasi mampu menentukan mungkin tidaknya sistem dapat berjalan.</p>\r\n\r\n\t<p>Kamu dapat menggunakan UML, DFD,&nbsp;<em>flowchart,&nbsp;</em>Lo-fi,&nbsp;dan UI UX untuk mempresentasikan ide-idemu sebelum diolah menjadi kode program.</p>\r\n\r\n\t<p>Selain itu, kamu wajib menguasai&nbsp;<a href=\"https://www.dicoding.com/blog/apa-itu-database/\">database</a>. Sebab, data-data di dalam aplikasi haruslah disimpan ke dalam database. Kamu harus mempelajari relasi setiap tabel database. Mau tidak mau harus mengerti tentang ERD (<em>Entity Relationship Diagram</em>).</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Kuasailah Bahasa Inggris</strong></h3>\r\n\r\n\t<p>Jangan lupa, kamu juga harus belajar bahasa Inggris. Sebab, hampir semua bahasa program dirancang menggunakan bahasa Inggris. Seperti perulangan menggunakan&nbsp;<em>if, else, then,&nbsp;</em>dll. Instruksi tersebut wajib dikuasai oleh&nbsp;programmer. Kamu tak perlu khawatir, zaman now banyak sekali pembelajaran&nbsp;<em>coding&nbsp;</em>menggunakan bahasa Inggris. Baik itu gratis maupun berbayar. Rugi jika tidak kamu manfaatkan.</p>\r\n\r\n\t<p>Kenapa kamu perlu bisa berbahasa Inggris? Iya karena eh karena, bahasa inggris adalah bahasa internasional. Bahasa merupakan&nbsp;<em>soft skill</em>&nbsp;yang akan kamu pakai di kemudian hari. Bahasa itu bagaikan jembatan komunikasi dengan klien. Mulailah belajar berbahasa Inggris, minimal kamu paham tingkat pasif dari bahasa itu sendiri.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai Sistem Operasi dan Aplikasi Lainnya</strong></h3>\r\n\r\n\t<p>Sistem operasi sangat menentukan penggunanya. Menentukan seperti apa? Sistem operasi ibaratkan senjata&nbsp;programmer karena berguna untuk menentukan bahasa pemrograman yang akan kamu pakai. Misal Windows, maka bahasa yang sangat berpotensi adalah C#, ASP.NET, SQL Server, dan Azure.&nbsp;</p>\r\n\r\n\t<p>Sedangkan untuk iOS, kemu perlu memulai dengan memasang Xcode dan menggunakan bahasa Swift.</p>\r\n\r\n\t<p>Intinya, tentukan kamu ingin membuat aplikasi untuk siapa. Lalu gunakanlah tools seperti teks editor yang menurut kamu enak dipakai.</p>\r\n\t</li>\r\n</ul><ul>\r\n\t<li>\r\n\t<h3><strong>Menguasai Source Management</strong></h3>\r\n\r\n\t<p>Git, Mercurial, dan Svn merupakan contoh tools yang dapat memudahkanmu dalam mengelola&nbsp;<em>source code</em>. Masih suka menyimpan perubahan kode menggunakan&nbsp;<em>flashdisk</em>? Mulai saat ini gunakanlah&nbsp;<em>source code management</em>.</p>\r\n\r\n\t<p>Itu akan mempermudahmu ketika bekerja dengan tim. Tak perlu repot, jika dibandingkan dengan&nbsp;<em>flashdisk</em>.&nbsp;<em>Flashdisk</em>&nbsp;rentan hilang, virus, terformat, dan harus colok ke laptop sana sini&nbsp;<em>lah</em>&nbsp;hehe. Dengan adanya&nbsp;<em>source management</em>, kamu dapat melihat kesalahan kode, perubahan yang telah dibuat, melakukan&nbsp;<em>rollback,&nbsp;</em>dan bila perlu juga dapat menambahkan&nbsp; komentar. Selagi ada koneksi internet data tetap aman dan mudah diakses oleh anggota tim kapan dan di mana saja.</p>\r\n\r\n\t<p>Beberapa&nbsp;<em>source code management</em>&nbsp;yang sering digunakan, terkenal, dan gratis ialah BitBucket, GitHub, dan GitLab.</p>\r\n\t</li>\r\n</ul><p>Baik, teman-teman. Itulah beberapa hal yang wajib dikuasai oleh seorang programmer. Tentunya masih banyak yang harus dipelajari dan dikuasai seperti&nbsp;<em>package manager,&nbsp;<a href=\"https://en.wikipedia.org/wiki/Unit_testing\" target=\"_blank\">unit testing</a>, code review, dll.&nbsp;</em>Adapun&nbsp;<em>soft skill</em>&nbsp;yang perlu kamu asah adalah&nbsp;<em>skill</em>&nbsp;berbicara, presentasi, dan bergaul dengan banyak teman&nbsp;programme<em>r</em>&nbsp;lain.</p><p>Jika kamu mantap ingin menjadi seorang programmer, alangkah baiknya kamu mengikuti beberapa kelas dari Dicoding&nbsp;<a href=\"https://www.dicoding.com/academies/list\">https://www.dicoding.com/academies/list</a>. Makin komplit deh pokoknya jalan ninjamu menjadi seorang&nbsp;programmer.&nbsp;</p><p>Simak juga beberapa artikel diantaranya:</p><ol>\r\n\t<li><a href=\"https://www.dicoding.com/blog/programmer-atau-pro-gamer-kamu-team-mana/\"><strong>Programmer Atau Pro Gamer, Kamu Team Mana?</strong></a></li>\r\n\t<li><a href=\"https://www.dicoding.com/blog/tips-dapat-tawaran-kerja-di-unicorn/\"><strong>3 Tips dari Anak Desa: agar dapat Tawaran Kerja di Unicorn saat Masih Kuliah&nbsp;</strong></a></li>\r\n\t<li><a href=\"https://www.dicoding.com/blog/algoritma-dulu-ngoding-kemudian-programmer-jangan-grasa-grusu/\"><strong>Algoritma Dulu Ngoding Kemudian, Programmer Jangan Grasa Grusu</strong></a></li>\r\n\t<li><a href=\"https://www.dicoding.com/blog/contoh-cv-lamaran-kerja/\"><strong>5 Contoh CV yang Menarik dan Kreatif untuk Developer</strong></a></li>\r\n</ol><p>Biar makin semangat belajar, simak quotes berikut ini nih.</p><blockquote>\r\n<p>&ldquo;Jika kamu tidak membangun mimpimu sendiri, maka seseorang akan mempekerjakan kamu untuk membangun mimpi mereka.&rdquo;&nbsp;</p>\r\n\r\n<p><strong>(Bill Gates)</strong></p>\r\n</blockquote></p>\n",
        "description_excerpt": "Perkembangan teknologi dapat membuka lapak kerja bagi seseorang. Terutama di era digital zaman now saat ini. Banyak startup yang membutuhkan pekerjaan untuk membuat dan mengembang",
        "status_post": "publish",
        "created_at": "2022-12-22 03:09:29",
        "updated_at": "2022-12-22 03:09:29",
        "deleted_at": null
    },
    {
        "id": 2,
        "title": "Pengertian Web Server, Fungsi, dan Cara Kerjanya",
        "slug_title": "pengertian-web-server-fungsi-dan-cara-kerjanya",
        "category_id": 1,
        "img_thumbnail": "pengertian-web-server-fungsi-dan-cara-kerjanya-16716786591.png",
        "description": "<p><strong>Pengertian Web Server</strong><p>Web server adalah sebuah perangkat lunak yang berfungsi untuk memberikan layanan berupa data, dan berfungsi menerima permintaan HTTP atau HTTPS dari klien yang menggunakan browser (chrome, firefox, dll).</p><p>Nantinya web server akan mengirimkan respon atas permintaan klien untuk menampilkan halaman website.</p><p>Web server ini sebenarnya memiliki dua pengertian yang berbeda, yaitu dari segi hardware dan software.</p><p>Dari pengertian hardware, web server adalah sebuah perangkat yang menyimpan komponen website seperti dokumen HTML, gambar, CSS stylesheets, dan JavaScript.</p><p>Web server harus terkoneksi ke internet agar mendukung pertukaran data secara fisik dengan perangkat lain yang juga terkoneksi internet.</p><p>Kemudian dari pengertian software, web server termasuk dalam beberapa bagian yang mengontrol setiap permintaan yang diajukan oleh klien menggunakan browser.</p><p>Apakah sampai di sini Gudpeople sudah paham pengertiannya?</p><p>Mudahnya, web server akan menyajikan layanan untuk klien yang meminta informasi dalam bentuk website.</p><h2><strong>Fungsi Web Server</strong></h2><p>Fungsi utama web server adalah menerima permintaan HTTP atau HTTPS dari klien atau web browser.</p><p>Kemudian web server akan meresponnya dengan menampilkan halaman web HTML, foto, video, dokumen, atau yang lainnya.</p><p>Di sisi lain, fungsi web server tidak hanya itu saja, melainkan masih ada beberapa fungsi dari web server.</p><p>Berikut ini adalah fungsi lain dari web server yang sebaiknya juga Anda ketahui.</p><ul>\r\n\t<li>Memeriksa sistem security yang berasal dari permintaan HTTP yang diminta oleh klien atau web browser.</li>\r\n\t<li>Membersihkan semua cache yang ada pada penyimpanana dan dokumen yang sudah tidak dipakai lagi.</li>\r\n\t<li>Menyediakan data sesuai permintaan yang masuk untuk menjamin kelancaran keamanan sistem yang berjalan.</li>\r\n</ul><p>Nah, itu tadi beberapa fungsi dari web server ya, Gudpeople.</p><h2><strong>Cara Kerja Web Server</strong></h2><p>Sekarang Anda akan mempelajari bagaimana cara kerja web server dengan detail seperti berikut ini.</p><p><a href=\"https://gudangssl.id/blog/wp-content/uploads/2021/11/cara-kerja-web-server.webp\"><img alt=\"cara kerja web server\" src=\"https://gudangssl.id/blog/wp-content/uploads/2021/11/cara-kerja-web-server.webp\"></a></p><p>Gambar: MDN Web Docs</p><ol>\r\n\t<li>Klien meminta untuk mengakses sebuah url domain yang dituliskan pada kolom address bar di aplikasi browser, kemudian permintaan tersebut akan dikirimkan ke DNS server.</li>\r\n\t<li>Jika halaman web tersebut memakai database programming akan dihubungkan ke database server.</li>\r\n\t<li>Kemudian jika alamat domain yang diminta dengan mengetikkan url tadi tersedia di web server, maka web server akan merespon dengan menampilkan halaman web.</li>\r\n\t<li>Namun, jika url domain tidak tersedia, akan muncul peringatan &ldquo;page not found&rdquo; yang berarti halaman tidak dapat ditemukan.</li>\r\n</ol><p>Semua proses itu akan terjadi sangat cepat selama terkoneksi ke internet.&nbsp;</p><h2><strong>Jenis-jenis Web Server</strong></h2><p>Web server memiliki jenis yang berbeda-beda tergantung dengan kelebihan dan kekurangannya masing-masing.</p><p>Berikut adalah jenis-jenis web server untuk menambah pengetahuan Anda.</p><ul>\r\n\t<li>\r\n\t<h3><strong>Apache</strong>&nbsp;</h3>\r\n\t</li>\r\n</ul><p>Web server ini adalah yang paling populer dan telah banyak digunakan banyak orang.</p><p>Fungsi software ini yang menggantikan fungsi server.</p><p>Apache juga mendukung beberapa program yang membuatnya lengkap, yakni PHP, SSI, dan Access Control.</p><p>Anda juga bisa mengunggah beragam file dengan beberapa bahasa pemrograman seperti PHP (personal home page atau PHP hypertext processor).</p><blockquote>\r\n<p><strong>Baca Juga:&nbsp;<a href=\"https://gudangssl.id/blog/apa-itu-apache/\" target=\"_blank\">Apa Itu Apache? Penjelasan Mengenai Apache Web Server</a></strong></p>\r\n</blockquote><ul>\r\n\t<li>\r\n\t<h3><strong>NginX</strong></h3>\r\n\t</li>\r\n</ul><p>Dibaca engine x, yang merupakan sebuah nama web server open source yang artinya bisa dipakai oleh siapa saja dengan bebas dan tidak berbayar.</p><p>NginX lebih unggul dari Apache dari segi penanganan website dengan traffic yang tinggi.</p><p>Ini yang membuat NginX sangat ideal bagi pebisnis profesional dengan pengunjung website yang tinggi.</p><p>Tak hanya itu, performa yang dimiliki oleh NginX juga terbilang sangat baik.</p><ul>\r\n\t<li>\r\n\t<h3><strong>Lighttpd</strong></h3>\r\n\t</li>\r\n</ul><p>Selanjutnya ada web server berbasis open source yang bernama Lighttpd, keunggulan yang dimilikinya adalah FastCGi, Output Compression, URL writing.</p><p>Web server ini diciptakan oleh seorang programmer asal Jerman.</p><p>Jika Anda sudah pernah mencoba web server ini maka dijamin Anda akan merasakan sendiri sensasi kecepatan yang tinggi.</p><ul>\r\n\t<li>\r\n\t<h3><strong>IIS</strong></h3>\r\n\t</li>\r\n</ul><p>Web server IIS (internet information services) merupakan web server yang mendukung jnis protokol DNS, TCP/IP, atau software lain yang berguna ketika merancang sebuah situs.</p><p>Itulah beberapa jenis web server yang kami rangkum dari banyaknya jenis web server yang tersedia di internet.</p><p>Kesemuanya tentu memiliki kelebihan dan kekurangannya masing-masing dalam mengelola permintaan klien yang ada.</p><blockquote>\r\n<p><strong>Baca Juga:&nbsp;<a href=\"https://gudangssl.id/blog/tcp-adalah/\" target=\"_blank\">Apa Itu TCP? Pengertian, Cara Kerja, dan Fungsinya</a></strong></p>\r\n</blockquote><h3><strong>Kesimpulan</strong></h3><p>Setelah Anda sudah cukup memahami web server di atas, pastinya Anda sudah mulai mengetahui betapa berperannya web server ini dalam mengontrol sebuah website.</p><p>Tugas mutlak web server adalah merespon setiap permintaan yang diajukan oleh klien melalui aplikasi browser, dan mengirimkannya kembali melalui browser.</p><p>Jika tidak ada web server, Anda pun tidak bisa melakukan request data pada suatu halaman atau halaman web.</p><p>Tak hanya web server, website juga akan lebih baik lagi apabila sudah terpasang&nbsp;<a href=\"https://gudangssl.id/\" target=\"_blank\">sertifikat SSL</a>.</p><p>SSL ini berfungsi untuk mengenkripsi data pengguna yang dikirimkan, serta dapat mengubah alamat protokol menjadi HTTPS (secured).</p><p>Dengan terpasangnya SSL, performa website di search engine pun akan meningkat karena website dinilai sudah aman untuk diakses oleh pengguna.</p><p>Namun, jika Anda bingung di mana tempat yang menyediakan sertifikat SSL murah berkualitas, Gudang SSL akan membantu Anda untuk memilih SSL yang sesuai.</p><p>Harga SSL yang kami tawarkan mulai dari harga seratus ribuan saja.</p><p>Terima kasih sudah membaca artikel ini ya, Gudpeople.</p><p>Semoga bermanfaat.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p></p>\n",
        "description_excerpt": "Web server adalah sebuah perangkat lunak yang berfungsi untuk memberikan layanan berupa data, dan berfungsi menerima permintaan HTTP atau HTTPS dari klien yang menggunakan browser",
        "status_post": "publish",
        "created_at": "2022-12-22 03:10:59",
        "updated_at": "2022-12-23 04:04:36",
        "deleted_at": null
    },
    {
        "id": 3,
        "title": "Android Developer: Tanggung Jawab, Skill, dan Karirnya",
        "slug_title": "android-developer-tanggung-jawab-skill-dan-karirnya",
        "category_id": 1,
        "img_thumbnail": "android-developer-tanggung-jawab-skill-dan-karirnya-16716787821.jpg",
        "description": "<p><strong>Apa Itu Android Developer?</strong><p><img alt=\"aplikasi-dari-android-developer\" src=\"https://global-uploads.webflow.com/6100d0111a4ed76bc1b9fd54/61c222611c0e9e6ad5106408_ApaituAndroidDeveloper.jpeg\"></p><p>&zwj;</p><p>Android Developer bisa dikatakan sebagai&nbsp;<em>software developer&nbsp;</em>yang memiliki spesialisasi merancang aplikasi untuk&nbsp;<em>marketplace</em>&nbsp;Android. Secara sederhana, mayoritas pekerjaan mereka adalah membuat aplikasi yang dapat digunakan di dalam&nbsp;<em>smartphone</em>&nbsp;ataupun tablet, baik itu berupa&nbsp;<em>game</em>&nbsp;maupun bentuk aplikasi lainnya.</p><p>Untuk menjadi Android Develope<em>r</em>, kamu setidaknya harus memiliki pengalaman serta pemahaman yang luas dalam bahasa pemrograman. Selanjutnya, seorang Android developer<a href=\"https://glints.com/id/lowongan/karier-developer-adalah/\" target=\"_blank\">&nbsp;</a>dapat bekerja secara&nbsp;<em>in-house</em>&nbsp;di sebuah perusahaan atau bekerja di dalam<em>&nbsp;app development agency</em>.</p><h2>Tanggung Jawab&nbsp;<em>Android Developer</em></h2><p><img alt=\"\" src=\"https://global-uploads.webflow.com/6100d0111a4ed76bc1b9fd54/61c22262d46c87a0dd557088_TanggungJawabAndroidDeveloper.jpeg\"></p><p>&zwj;</p><p>Dilansir dari&nbsp;<a href=\"https://www.jobhero.com/what-is-an-android-developer/\" target=\"_blank\">Job Hero</a>, ada beberapa tugas utama yang dikerjakan oleh seorang Android Developer, di antaranya adalah:</p><h3>1. Merancang dan membangun aplikasi untuk smartphone Android</h3><p>Bisa dibilang, ini adalah tugas utama seorang Android Developer. Hampir seluruh waktu dan tenaga mereka didedikasikan untuk keperluan ini.</p><p>Dalam menjalani tugas tersebut, developer dituntut untuk selalu teliti dan berorientasi pada detail. Jika ada kesalahan, aplikasi bisa tidak berjalan. Memperbaiki kesalahan akan memakan waktu dan kemungkinan terburuknya harus mengulang dari nol.</p><h3>2. Berkolaborasi dengan tim lainnya</h3><p>Dalam hal ini, seorang developer dituntut untuk bisa bekerjasama dalam tim dan memiliki skill komunikasi yang baik. Mengapa? Karena kesibukan Android Developer sangat sulit untuk dikerjakan seorang diri. Biasanya, mereka akan bekerja dalam tim agar prosesnya berjalan dengan lancar.</p><p>Selain itu, Android Developer perlu berkoordinasi dengan tim lainnya. Sebagai contoh, mereka akan bekerja dengan tim Product Development dan UI/UX Design untuk merancang menetapkan dan merancang fitur yang sekiranya apa yang diinginkan oleh calon penggunanya.</p><h3>3. Bekerja dengan sumber data eksternal dan API</h3><p>Sebelum melakukan perancangan aplikasi, developer harus menelaah dan menganalisis data-data yang didapat; baik dari arsip sebelumnya, data intergrasi dari tim lain, maupun data baru dari internal tim Android Developer sendiri.</p><p>Agar semua berjalan dengan lancar, developer perlu mengasah skill critical thinking untuk mengimplementasikan data-data ke dalam proyek yang diberikan.</p><h3>4. Memperbaiki dan mengembangkan aplikasi yang sudah ada</h3><p>Saat aplikasi sudah diluncurkan ke publik, bukan berarti pekerjaan Android Developer selesai sampai di situ saja! Jika terdapat masalah atau bug yang dilaporkan oleh user, mereka harus siap untuk memperbaikinya.</p><p>Ditambah lagi, mereka juga perlu memikirkan fitur atau peningkatan apa lagi yang bisa ditambahkan ke dalam aplikasi tersebut sebelum dikembalikan ke publik. Jadi, kerjanya seru dan jangka panjang~</p><h3>5. Mencari, evaluasi, dan mengimplementasi teknologi baru</h3><p>Menjadi seorang Android Developer dituntut untuk tetap&nbsp;<em>up-to-date</em>&nbsp;terhadap tren aplikasi&nbsp;<em>smartphone</em>. Mereka diharuskan untuk mencoba dan mengevaluasi&nbsp;<em>tools</em>&nbsp;baru yang muncul serta menimbang apakah ia perlu diimplementasikan ke dalam aplikasi.</p><p>Karena itu, para developer perlu cermat dalam beradaptasi dengan lingkungan yang terus berubah. Jadi, mikir terus biar sukses~</p><h2><strong>6 Skills yang Dibutuhkan untuk Menjadi Android Developer</strong></h2><p>Untuk menjadi seorang pengembang aplikasi Android, kamu wajib menguasai beberapa skill di bawah ini.</p><h3><strong>1. Bahasa Pemrograman Android</strong></h3><p>Skill pertama yang wajib dikuasai oleh seorang Android App Developer adalah bahasa pemrograman. Saat ini ada dua jenis bahasa yang paling sering digunakan untuk membangun sebuah aplikasi Android yaitu Kotlin dan Java.&nbsp;</p><p>Masing-masing bahasa pemrograman tersebut memiliki keunggulan dan kelemahan. Java termasuk bahasa lama dan lebih lengkap dari sisi library serta dokumentasi. Sayangnya, struktur codingnya dipandang terlalu rumit dan panjang.</p><p>Sementara Kotlin, termasuk bahasa pemrograman baru yang menawarkan struktur program sangat ringkas. Kotlin juga dapat diimplementasikan di dalam kode Java. Bahasa baru ini terbukti mampu mempersingkat waktu development dan menguntungkan perusahaan dari segi bisnis.</p><h3><strong>2. Android SDK</strong></h3><p>Tak hanya bahasa pemrograman, kamu juga wajib menguasai&nbsp;<em>Software Development Kit</em>&nbsp;(SDK) Android. SDK sendiri merupakan sekumpulan software yang dipakai untuk proses pengembangan aplikasi supaya dapat berjalan dengan lebih efisien dan efektif.</p><p>Dengan menguasai Android SDK, artinya kamu dapat menggunakan sample code, dokumentasi, emulator, software libraries, serta debugger selama proses Android software development.</p><h3><strong>3. Mampu Menggunakan API</strong></h3><p>Beberapa aplikasi di Android sangat kompleks dan mengandung konten yang terdapat di aplikasi lain. Contohnya yaitu Gojek dan Grab yang menggunakan API dari Google Maps sehingga mereka tidak perlu membuat peta sendiri.</p><p>Nah, seorang Android App Developer dituntut untuk memiliki kemampuan menggunakan berbagai jenis API agar lebih efektif dalam membangun aplikasi. API juga dapat membuat aplikasi bekerja dengan lebih smooth.</p><h3><strong>4.<em>&nbsp;</em>Pemahaman Akan Arsitektur dan<em>&nbsp;Framework</em></strong></h3><p>Seseorang bisa bekerja dengan baik apabila mengetahui apa yang sedang dikerjakannya. Hal ini juga berlaku untuk Android App Developer atau Mobile App Developer pada umumnya. Mereka harus benar-benar memahami arsitektur aplikasi.</p><p>Pemahaman akan arsitektur akan mendorong developer untuk mengembangkan aplikasi yang baik dari segi UI, performa, usability, dan bisnis.&nbsp;</p><p>Sementara pemahaman akan framework akan membantu developer untuk membangun aplikasi dengan lebih cepat. Pasalnya, di dalam framework sudah terdapat rangkaian fungsi dan perintah-perintah umum yang siap pakai.&nbsp;&nbsp;</p><h3><strong>5. Desain UI/UX</strong></h3><p><em>User interface</em>&nbsp;atau (UI) dan user experience (UX) adalah dua hal berbeda namun tidak dapat dipisahkan. UI sendiri lebih fokus pada pengembangan desain aplikasi agar memiliki tampilan yang baik.</p><p>Sementara UX lebih fokus pada bagaimana sebuah aplikasi dapat bekerja dengan baik dan menjalankan fungsi sesuai kebutuhan sehingga pengguna mendapatkan pengalaman yang baik.&nbsp;</p><p>Pemahaman akan desain UI dan UX akan membantu developer menciptakan sebuah aplikasi yang mampu menjawab kebutuhan user serta mudah digunakan.</p><h3><strong>6. Siap dengan Kultur Kerja di Mobile App Development</strong></h3><p>Seorang Android Developer dituntut untuk mampu menyelesaikan segala permasalahan yang muncul di sepanjang pembangunan aplikasi, misalnya&nbsp;<em>bug</em>&nbsp;atau&nbsp;<em>error</em>.&nbsp;</p><p>Developer juga harus siap dengan perubahan tren yang akan terus terjadi di masa mendatang. Oleh karena itu, seorang Android App Developer harus selalu memiliki semangat untuk mempelajari hal-hal yang baru. Pasalnya, dunia mobile app development, khususnya Android sangat dinamis.</p><p>Contohnya saja ketika Kotlin muncul dengan segala kemudahannya. Meski menawarkan kemudahan dibandingkan Java, developer harus tetap mempelajari Kotlin dari awal sebelum bisa menggunakannya.</p><h2><em>Career Path</em>&nbsp;Seorang Android Developer</h2><p><img alt=\"android-developer-1\" src=\"https://global-uploads.webflow.com/6100d0111a4ed76bc1b9fd54/61c22262bb55e0978aee84ab_PeluangKarierAndroidDeveloper.jpeg\"></p><p>&zwj;</p><p>Dalam industri pengembangan Android, banyak sekali tim yang dibutuhkan untuk memastikan sistemnya ini berjalan dengan baik. Maka dari itu, banyak juga posisi lain yang ditawarkan seperti:</p><ul>\r\n\t<li><em>Mobile Architect</em></li>\r\n\t<li><em>Android Engineer</em></li>\r\n\t<li><em>Mobile App Developer</em></li>\r\n\t<li><em>Mobile Lead Software Engineer</em></li>\r\n\t<li><em>Android Mobile Developer</em></li>\r\n\t<li><em>Mobile Developer</em></li>\r\n\t<li><em>Mobile Embedded Software Engineer</em></li>\r\n</ul><p>&zwj;</p><p><img alt=\"android-developer-2\" src=\"https://global-uploads.webflow.com/6100d0111a4ed76bc1b9fd54/61c22262ca2f76861d74f8bb_UntungnyamenjadiAndroidDeveloper.jpeg\"></p><p>Nah, menurut&nbsp;<a href=\"https://acadgild.com/blog/10-reasons-transform-your-android-career\" target=\"_blank\">Acadgild&nbsp;</a>ada beberapa keuntungan khusus dalam berkarier dalam bidang Android Development<em>,&nbsp;</em>di antaranya adalah:</p><ul>\r\n\t<li>Banyaknya permintaan untuk para kandidat yang memiliki&nbsp;<em>skill</em>&nbsp;ini. Tak hanya di Indonesia, di luar negeri posisi juga sangat dicari sehingga kesempatan dalam bekerja sangat luas.</li>\r\n\t<li>Bayaran yang sangat besar.&nbsp;<em>Skill</em>&nbsp;yang kamu miliki sangat berbanding lurus dengan pendapatan yang akan diberikan oleh perusahaan.</li>\r\n\t<li>Banyaknya pilihan profesi dalam dunia Android.</li>\r\n\t<li>Android tumbuh secara stabil.</li>\r\n\t<li>Karier dalam Android sangat menantang.</li>\r\n\t<li>Kebebasan dalam jam kerja. Beberapa perusahaan membebaskan para karyawannya untuk tidak bekerja secara ketat dari jam 9 sampai jam 5 sore. Banyak perusahaan yang memperbolehkan bekerja secara&nbsp;<em>remote.</em></li>\r\n\t<li>Kesempatan berkarier yang sangat luas. Setelah kamu lepas dari Android, banyak sekali perusahaan besar yang mengincar skill dari pengalaman yang sudah kamu jalankan.</li>\r\n</ul><p>Meniti karier dalam bidang Android Development, tentunya adalah hal yang menarik dan memiliki masa depan cukup baik. Mengingat, penggunaan Android dari tahun ke tahun semakin bertambah dan tak pernah redup. Inovasi-inovasi yang ditawarkan tentunya akan menjadi tugas tersendiri bagi para tim pengembangan Android.</p><p>Nah, jika kamu tertarik untuk menjadi seorang Android Developer, kamu bisa memulai mempelajari langkah awalnya dengan mengikuti&nbsp;<a href=\"https://www.binaracademy.com/bootcamp/android-engineering\">bootcamp Android Engineering</a>&nbsp;di Binar Academy! Di sini, kamu akan diajarkan dari tahap yang paling dasar. Jadi, nggak perlu takut meski bukan berasal dari&nbsp;<em>background&nbsp;</em>IT!</p><p>Apabila kamu ingin menambahkan pemahaman mendasar terlebih dahulu, kamu bisa akses secara gratis materi terkait Android Engineering dengan mengunduh&nbsp;<a href=\"https://j5478.app.link/Downloadbinar5\">aplikasi Binar Academy</a>&nbsp;yang tersedia di PlayStore &amp;&nbsp;AppStore. Selamat menggali ilmu!</p></p>\n",
        "description_excerpt": "Android Developer bisa dikatakan sebagai software developer yang memiliki spesialisasi merancang aplikasi untuk marketplace Android.",
        "status_post": "publish",
        "created_at": "2022-12-22 03:13:02",
        "updated_at": "2022-12-23 04:04:54",
        "deleted_at": null
    }
]
